Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Currently, the behaviour is the same as if the value was first converted to boolean.
pt_br: Atualmente, o comportamento é o mesmo como se primeiro o valor fosse convertido para booleano.

source: However, do not rely on this behaviour, as it can change without notice.
pt_br: Entretanto, não confie neste comportamento, pois ele pode mudar sem aviso.

source: Floating point numbers
pt_br: Números de ponto flutuante

source: The special NULL value represents that a variable has no value.
pt_br: O valor especial NULL O valor especial NULL representa que a variável não tem valor.

source: NULL is the only possible value of type NULL.
pt_br: NULL é o único valor possível do tipo NULL.

source: The null type was introduced in PHP 4
pt_br: O tipo NULL foi incluído no PHP 4

source: A variable is considered to be NULL if
pt_br: A variável é considerada NULL se

source: it has been assigned the constant NULL.
pt_br: ela foi assimilada com a constante NULL.

source: it has not been set to any value yet.
pt_br: ela ainda não recebeu nenhum valor ainda.

source: it has been unset().
pt_br: ela foi apagada com unset().

source: There is only one value of type NULL, and that is the case-insensitive keyword NULL.
pt_br: Há apenas um único valor do tipo NULL, e é a palavra (insensitiva ao caso) NULL.

source: ?php $var = NULL;?
pt_br: $var = NULL;

source: See also is_null() and unset().
pt_br: Veja também is_null() e unset().

source: Pseudo-types used in this documentation
pt_br: Pseudo-tipos utilizados nesta documentação

source: To initialize an object, you use the new statement to instantiate the object to a variable.
pt_br: Inicialização de objetos

source: For a full discussion, please read the section Classes and Objects.
pt_br: Para inicializar um objeto, você usa a instrução new, criando uma instância do objeto em uma variável.

source: If a value of any other type is converted to an object, a new instace of the stdClass built in class is created.
pt_br: ?php class foo {function do_foo() {echo "Fazendo foo .";}} $bar = new foo; $bar - do_foo();?

source: For any other value, a member variable named scalar will contain the value.
pt_br: Para uma explicação completa, consulte a seção Classes e Objetos.

source: ?php $obj = (object) 'ciao'; echo $obj - gt;scalar; / / outputs'ciao '?
pt_br: Anterior

source: A resource is a special variable, holding a reference to an external resource.
pt_br: Recurso é uma variável especial, mantendo uma referência de recurso externo.

source: Resources are created and used by special functions.
pt_br: Recursos são criados e utilizados por funções especiais.

source: See the appendix for a listing of all these functions and the corresponding resource types.
pt_br: Veja o apêndice para uma lista de todas essas funções e seus tipos correspondentes.

source: The resource type was introduced in PHP 4
pt_br: O tipo resource foi incluído no PHP 4

source: As resource types hold special handlers to opened files, database connections, image canvas areas and the like, you cannot convert any value to a resource.
pt_br: Liberando recursos

source: Due to the reference-counting system introduced with PHP4' s Zend-engine, it is automatically detected when a resource is no longer referred to (just like Java).
pt_br: Através do sistema de contagem de referências introduzido com o engine da Zend no PHP 4, é automaticamente detectado quando um recurso não mais é referenciado (assim como o Java).

source: When this is the case, all resources that were in use for this resource are made free by the garbage collector.
pt_br: Quando isto acontece, todos os recursos em uso por esse resource são liberados pelo coletor de lixo.

source: For this reason, it is rarely ever necessary to free the memory manually by using some free_result function.
pt_br: Por essa razão, é raramente necessário liberar memória manualmente utilizando alguma função free_result.

source: Persistent database links are special, they are not destroyed by the garbage collector.
pt_br: Eles não são destruídos pelo coletor de lixo.

source: See also the section about persistent connections.
pt_br: Veja também conexões permanentes.

source: A string is series of characters.
pt_br: Strings

source: This also implies that PHP has no native support of Unicode.
pt_br: No PHP, um caracter é o mesmo que um byte, ou seja, há exatamente 256 caracteres diferentes possíveis.

source: See utf8_encode() and utf8_decode() for some Unicode support.
pt_br: Isto implica que o PHP não tem suporte nativo ao Unicode.

source: It is no problem for a string to become very large.
pt_br: Não há nenhum problema nas strings se tornarem muito grandes.

source: There is no practical bound to the size of strings imposed by PHP, so there is no reason at all to worry about long strings.
pt_br: Sintaxe

source: A string literal can be specified in three different ways.
pt_br: Uma string literal pode ser especificada de três formas diferentes.

source: single quoted
pt_br: aspas

source: double quoted
pt_br: sintaxe heredoc

source: heredoc syntax
pt_br: Apóstrofos

source: The easiest way to specify a simple string is to enclose it in single quotes (the character ').
pt_br: A maneira mais simples para especificar uma string é delimitá-la entre apóstrofos (o caracter ').

source: To specify a literal single quote, you will need to escape it with a backslash (\), like in many other languages.
pt_br: Para especificar um apóstrofo. você precisará "escapá-la" com uma contra barra (\), como em muitas outras linguagens.

source: If a backslash needs to occur before a single quote or at the end of the string, you need to double it.
pt_br: Se uma contra barra precisa ocorrer antes de um apóstrofo ou no final da string, você precisa duplicá-la.

source: Note that if you try to escape any other character, the backslash will also be printed!
pt_br: Note que se você tentar escapar qualquer outro caracter, a contra barra também será impressa!

source: So usually there is no need to escape the backslash itself.
pt_br: Então geralmente não é necessário escapar a própria contra barra.

source: In PHP 3, a warning will be issued at the E_NOTICE level when this happens.
pt_br: No PHP 3, um aviso com nível E_NOTICE será emitido quando isto acontecer.

source: Unlike the two other syntaxes, variables will not be expanded when they occur in single quoted strings.
pt_br: Diferentemente das duas outras sintaxes, variáveis não serão substituídas quando elas ocorrerem dentro de strings delimitadas por apóstrofes.

source: You deleted C:\*.*? echo 'You deleted C:\\*.* ?'; / / Outputs:
pt_br: echo 'isto é uma string comum'; echo 'Você pode incluir novas linhas em strings, dessa maneira'; echo 'Arnold disse uma vez: "I\'ll be back"'; / / saida:... "I'll be back "echo 'Você tem certeza em apagar C:\\*.* ?'; / / saida:... apagar C:\*.*? echo 'Você tem certeza em apagar C:\*.* ?'; / / output:... apagar C:\*.*? echo 'Estou tentando incluir uma nova linha \n neste ponto'; / / output:... nova linha \n neste ponto

source: You deleted C:\*.*? echo 'You deleted C:\*.* ?'; / / Outputs:
pt_br: Aspas

source: Variables do not $expand $either echo 'Variables do not $expand $either';?
pt_br: Se a string é delimitada entre aspas ("), o PHP entende mais seqüências de escape para caracteres especiais:

source: If the string is enclosed in double-quotes ("), PHP understands more escape sequences for special characters:
pt_br: Tabela 7-1.

source: Table 7-1.
pt_br: Seqüências de escape

source: Escaped characters
pt_br: Seqüência

source: sequence
pt_br: Significado

source: linefeed (LF or 0x0A (10) in ASCII)
pt_br: fim de linha (linefeed ou LF ou 0x0A (10) em ASCII)

source: carriage return (CR or 0x0D (13) in ASCII)
pt_br: retorno de carro (carriage return ou CR ou 0x0D (13) em ASCII)

source: horizontal tab (HT or 0x09 (9) in ASCII)
pt_br: TAB horizontal (HT ou 0x09 (9) em ASCII)

source: backslash
pt_br: contra barra ou barra invertida

source: dollar sign
pt_br: sinal de cifrão

source: double-quote
pt_br: aspas

source: the sequence of characters matching the regular expression is a character in octal notation
pt_br: a seqüência de caracteres batendo a expressão regular dos caracteres em notação octal

source: the sequence of characters matching the regular expression is a character in hexadecimal notation
pt_br: a seqüência de caracteres batendo a expressão regular de um caracter em notação hexadecimal

source: Again, if you try to escape any other character, the backslash will be printed too!
pt_br: Novamente se você tentar escapar qualquer outro caracter, a contra barra será impressa também!

source: See string parsing for details.
pt_br: Mas o mais importante dado a respeito de strings delimitadas por aspas está no fato de que nome de variáveis serão substituídos.

source: Another way to delimit strings is by using heredoc syntax ("").
pt_br: Veja interpretação de strings para detalhes.

source: One should provide an identifier after, then the string, and then the same identifier to close the quotation.
pt_br: Heredoc

source: The closing identifier must begin in the first column of the line.
pt_br: Outra maneira para delimitar strings é utilizando a sintaxe heredoc ("").

source: It is very important to note that the line with the closing identifier contains no other characters, except possibly a semicolon (;).
pt_br: O identificador de fechamento precisa começar na primeira coluna da linha.

source: It 's also important to realize that the first character before the closing identifier must be a newline as defined by your operating system.
pt_br: Além, o identificador utilizado precisa seguir as mesmas regras de nomeação que qualquer outro rótulo no PHP: só pode conter caracteres alfanuméricos e sublinhados, e precisa começar com um caracter não numérico ou sublinhado.

# This is on Macintosh for example.
source: This is \r on Macintosh for example.
pt_br: Atenção

source: If this rule is broken and the closing identifier is not "clean" then it's not considered to be a closing identifier and PHP will continue looking for one.
pt_br: É muito importante verificar que a linha do identificador de fechamento não contenha nenhum outro caracter, exceto, possivelmente um ponto e vírgula (;).

source: If in this case a proper closing identifier is not found then a parse error will result with the line number being at the end of the script.
pt_br: O que significa que o identificador não pode ser endentado, e que não pode haver nenhum espaço ou tabulações antes ou depois do ponto e vírgula.

source: Heredoc text behaves just like a double-quoted string, without the double-quotes.
pt_br: Textos heredoc se comportam como strings delimitadas por aspas, com apenas uma diferença.

source: This means that you do not need to escape quotes in your here docs, but you can still use the escape codes listed above.
pt_br: Você não precisa escapar apóstrofos e aspas em seus heredocs, mas você ainda pode continuar utilizando os códigos de escape listados acima.

source: Variables are expanded, but the same care must be taken when expressing complex variables inside a here doc as with strings.
pt_br: Variáveis são substituídas, mas o mesmo cuidado precisa ser tomado quando expressando variáveis complexas dentro de heredocs assim como nas strings.

source: Example 7-2.
pt_br: Exemplo 7-2.

source: Heredoc string quoting example
pt_br: Exemplo de delimitação de strings heredoc

source: ?php $str = EOD Example of string spanning multiple lines using heredoc syntax.
pt_br: ?php $str = EOD Exemplo de uma string distribuída em várias linhas utilizando a sintaxe heredoc.

source: EOD; / * More complex example, with variables. * / class foo {var $foo; var $bar; function foo() {$this - foo = 'Foo'; $this - bar = array('Bar1', 'Bar2', 'Bar3');}} $foo = new foo(); $name = 'MyName'; echo EOT My name is "$name ".
pt_br: EOD; / * Exemplo mais complexo, com variáveis * / class foo {var $foo; var $bar; function foo() {$this - foo = 'Foo'; $this - bar = array('Bar1', 'Bar2', 'Bar3');}} $foo = new foo(); $name = 'Meu nome'; echo EOT Meu nome é "$name ".

source: I am printing some $foo - foo.
pt_br: Eu estou imprimindo $foo - foo.

source: Now, I am printing some {$foo - bar[1]}.
pt_br: Agora, eu estou imprimindo {$foo - bar[1]}.

source: This should print a capital 'A': \x41 EOT;?
pt_br: Isto deve imprimir um 'A' maiúsculo: \x41 EOT;?

source: Heredoc support was added in PHP 4.
pt_br: O suporte a heredoc foi acrescentado no PHP 4.

source: When a string is specified in double quotes or with heredoc, variables are parsed within it.
pt_br: Interpretação de variáveis

source: The simple syntax is the most common and convenient, it provides a way to parse a variable, an array value, or an object property.
pt_br: Há dois tipos de sintaxe, um simples e um complexo.

source: The complex syntax was introduced in PHP 4, and can be recognised by the curly braces surrounding the expression.
pt_br: A sintaxe simples é a mais comum e conveniente, provendo uma maneira de interpretar uma variável, um valor de array ou uma propriedade de objeto.

source: If a dollar sign ($) is encountered, the parser will greedily take as much tokens as possible to form a valid variable name.
pt_br: A sintaxe completa foi introduzida no PHP 4, e pode ser reconhecida por chaves ({}) envolvendo a expressão.

source: Enclose the variable name in curly braces if you want to explicitly specify the end of the name.
pt_br: Sintaxe simples

source: ?php $beer = 'Heineken'; echo "$beer's taste is great"; / / works, "'"is an invalid character for varnames echo "He drank some $beers"; / / won't work, 's' is a valid character for varnames echo "He drank some ${beer}s"; / / works echo "He drank some {$beer}s"; / / works?
pt_br: Se um sinal de cifrão ($) é encontrado, o interpretador tentará obter tantos identificadores quanto possíveis para formar um nome de variável válido.

source: Similarly, you can also have an array index or an object property parsed.
pt_br: Envolva o nome da variável com chaves se você deseja explicitamente especificar o fim do nome.

source: For object properties the same rules apply as to simple variables, though with object properties there doesn 't exist a trick like the one with variables.
pt_br: $cerveja = 'Heineken'; echo "O sabor das '$cerveja's é otimo"; / / funciona, "'"é um caracter inválido para nome de variáveis echo "Ele bebeu algumas $cervejas"; / / não funciona, 's' é um caracter válido para nome de variáveis echo "Ele bebeu algumas ${cerveja}s"; / / funciona

source: This results in a parse error. echo "A banana is $fruits['banana'] ."; / / Works echo "A banana is". $fruits['banana']. "."; / / Works echo "This square is $square - width meters broad ."; / / Won't work.
pt_br: Similarmente, você também pode interpretar um índice de array ou uma propriedade de objeto.

source: For a solution, see the complex syntax. echo "This square is $square - width00 centimeters broad .";?
pt_br: Com índices de arrays, o colchete de fechamento (]) marca o final do índice.

source: This isn 't called complex because the syntax is complex, but because you can include complex expressions this way.
pt_br: Para propriedades de objetos se aplicam as mesmas regras das variáveis comuns, embora não exista um truque para as propriedades de objetos como para as variáveis.

source: You simply write the expression the same way as you would outside the string, and then include it in {and}.
pt_br: $frutas = array( 'morangos '= 'vermelho', 'banana '= 'amarelo'); / / note que isto funciona diferentemente fora de delimitadores de string echo "Uma banana é $frutas[banana] ."; echo "Este quadrado tem $square - width metros de lado ."; / / Não funciona.

source: Some examples to make it clear:
pt_br: Para uma solução, veja a sintaxe complexa. echo "Este quadrado tem $square - width00 centímetros de lado .";

source: ?php / / Let' s show all errors error_reporting(E_ALL); $great = 'fantastic'; / / Won't work, outputs:
pt_br: Para qualquer coisa mais complexa, você precisa utilizar a sintaxe complexa.

source: This is {fantastic} echo "This is {$great}"; / / Works, outputs:
pt_br: Sintaxe complexa (chaves)

source: This is fantastic echo "This is {$great}"; echo "This is ${great}"; / / Works echo "This square is {$square - width}00 centimeters broad ."; / / Works echo "This works: {$arr[4][3]}"; / / This is wrong for the same reason as $foo[bar] is wrong / / outside a string.
pt_br: Isto não é chamado sintaxe complexa porque a sintaxe em si é complexa, mas porque você pode incluir expressões complexas desta maneira.

source: In otherwords, it will still work but / / because PHP first looks for a constant named foo, it will / / throw an error of level E_NOTICE (undefined constant). echo "This is wrong: {$arr[foo][3]}"; / / Works.
pt_br: De fato, você pode incluir qualquer valor no que esteja no espaço de nomes dentro de strings com esta sintaxe.

source: Characters within strings may be accessed by specifying the zero-based offset of the desired character after the string in curly braces.
pt_br: Desde que você não pode escapar '{', esta sintaxe somente será reconhecida quando o $é imediatamente seguido de um {. (Utilize "{\$ "ou "\{$" para obter um literal "{$").

source: However, this syntax is deprecated as of PHP 4.
pt_br: $maravilhoso = 'fantástico'; echo "Isto é {$maravilhoso}"; / / não funciona, imprime:

source: Some string examples
pt_br: Isto é {fantástico} echo "Isto é {$maravilhoso}"; / / funciona, imprime:

source: Strings may be concatenated using the '.' (dot) operator.
pt_br: Isto é fantástico echo "Este quadrado tem {$square - width}00 centímetros de lado ."; echo "E isto funciona: {$arr[4][3]}"; / / E isto está errado pela mesma razão / / como $foo[bar] é incorreto fora de uma string. echo "Isto está errado: {$arr[foo][3]}"; echo "Você deve fazer desta maneira: {$arr['foo'][3]}"; echo "Você pode sempre escrever {$obj - values[3] - name}"; echo "Este é o valor da variável chamada $name: {${$name}}";

source: Note that the '+' (addition) operator will not work for this.
pt_br: Acesso a caracteres da string

source: There are a lot of useful functions for string modification.
pt_br: Caracteres nas strings podem ser acessados apenas especificando o deslocamento baseado em zero do caracter desejado depois da string dentro de chaves.

source: Perl and POSIX extended).
pt_br: Para manutenção de compatibilidade, você ainda pode utilizar colchetes.

source: There are also functions for URL-strings, and functions to encrypt / decrypt strings (mcrypt and mhash).
pt_br: Entretanto, esta sintaxe for marcada como em extinção desde o PHP 4.

source: Finally, if you still didn' t find what you're looking for, see also the character type functions.
pt_br: Alguns exemplos com strings

source: String conversion is automatically done in the scope of an expression for you where a string is needed.
pt_br: ?php / * Assimilando uma string. * / $str = "Isto é uma string"; / * Anexando a ela. * / $str = $str." com uma pouco mais de texto"; / * Outra maneira de acrescentar, incluindo uma nova linha. * / $str .= "e um fim de linha no final (duh).\n"; / * Esta string será mostrada assim 'p Número:

source: Reading the manual sections on Types and Type Juggling will make the following clearer.
pt_br: 9 / p '* / $num = 9; $str = "p Número: $num / p"; / * Isto será apenas' p Número: $num / p '* / $num = 9; $str =' p Número: $num / p '; / * Pega o primeiro caracter de uma string * / $str = 'Isto é um teste .'; $first = $str{0}; / * Pega o último caracter da string. * / $str = 'Isto ainda é um teste .'; $last = $str{strlen($str)-1};?

source: A boolean TRUE value is converted to the string "1", the FALSE value is represented as "" (empty string).
pt_br: Funções úteis

source: This way you can convert back and forth between boolean and string values.
pt_br: Strings podem ser concatenados utilizando o operador '.' (ponto).

source: An integer or a floating point number (float) is converted to a string representing the number with its digits (including the exponent part for floating point numbers).
pt_br: Note que o operador '+' (adição) não funciona para isso.

source: Arrays are always converted to the string "Array", so you cannot dump out the contents of an array with echo() or print() to see what is inside them.
pt_br: Veja operadores de string para mais informações.

source: See below for tips on dumping / viewing the entire contents.
pt_br: Há uma grande quantidade de funções úteis para modificação de strings.

source: If you would like to print out the member variable values of an object If you would like to print out the member variable values of an object for debugging reasons, read the paragraphs below.
pt_br: Veja a seção de funções de string para funções gerais e funções de expressões regulares para busca e substituição avançada. (em dois sabores:

source: If you would like to find out the class name of which an object is an instance of, use get_class().
pt_br: Perl e POSIX estendido).

source: Resources are always converted to strings with the structure "Resource id #1" where 1 is the unique number of the resource assigned by PHP during runtime.
pt_br: Há também funções para strings URL e funções para criptografia e descriptografia de strings (mcrypt e mhash).

source: NULL is always converted to an empty string.
pt_br: Finalmente, se você ainda não encontrar o que está procurando, veja também as funções de tipos de caracteres.

source: As you can see above, printing out the arrays, objects or resources does not provide you any useful information about the values themselfs.
pt_br: Conversão de strings

source: You can also convert PHP values to strings to store them permanently.
pt_br: Quando uma string é avaliada como um valor numérico, o valor resultante e o tipo é determinado como segue.

source: You can also serialize PHP values to XML structures, if you have WDDX support in your PHP setup.
pt_br: A string será avaliada como um ponto flutuante se conter qualquer um dos caracteres '.', 'e', ou 'E'.

source: When a string is evaluated as a numeric value, the resulting value and type are determined as follows.
pt_br: Em outros casos, ela será avaliada como um inteiro.

source: The string will evaluate as a float if it contains any of the characters' .', 'e', or'E '.
pt_br: O valor é obtido da porção inicial da string.

source: The value is given by the initial portion of the string.
pt_br: Se a string começa com dados numéricos válidos, esse será o valor utilizado.

source: If the string starts with valid numeric data, this will be the value used.
pt_br: Em outro caso, o valor será 0 (zero).

source: Valid numeric data is an optional sign, followed by one or more digits (optionally containing a decimal point), followed by an optional exponent.
pt_br: Dados numéricos válidos são: um sinal opcional, seguido por um ou mais dígitos (opcionalmente contendo um ponto decimal), seguido de um expoente, também opcional.

source: The exponent is an 'e' or'E 'followed by one or more digits.
pt_br: O expoente é um 'e' ou 'E 'seguido de um ou mais dígitos.

source: For more information on this conversion, see the Unix manual page for strtod( 3).
pt_br: $foo = 1 + "10.5"; / / $foo é ponto flutuante (11.5) $foo = 1 + "-1.3e3"; / / $foo é ponto flutuante (-1299) $foo = 1 + "bob-1.3e3"; / / $foo é ponto inteiro (1) $foo = 1 + "bob3"; / / $foo é ponto inteiro (1) $foo = 1 + "10 Small Pigs"; / / $foo é ponto inteiro (11) $foo = 4 + "10.2 Little Piggies"; / / $foo é ponto flutuante (14.2) $foo = "10.0 pigs" + 1; / / $foo é ponto flutuante (11) $foo = "10.0 pigs "+ 1.0; / / $foo é ponto flutuante (11)
